from pyrogram.types import InlineKeyboardButton


class Keshav:
   
    #Alpha Buttons
    alpha_buttons = [
         [InlineKeyboardButton("✨ ᴀʙᴏᴜᴛ ᴜᴘᴅᴀᴛᴇ 💫", callback_data="cmda")],
         [InlineKeyboardButton("✨ ᴄʀᴇᴅɪᴛs 💫", callback_data="credits")]
    ]
    
    home_button = [
        [InlineKeyboardButton("✨Back🕊", callback_data="home")]
    ]


    # aboutupdate
    CMDA = """
** ᴜɴᴏғғɪᴄɪᴀʟ ᴇxᴛᴇɴsɪᴏɴ ʙʏ ᴀʟᴘʜᴀ**
$_> ᴘʀᴇsᴇɴᴛ ᴠᴇʀsɪᴏɴ ᴏғ ʟɪғᴇ ɢᴀᴍᴇs ɪs ʙᴏʀᴇᴅ ᴀғ , sᴏ ɢᴏɪɴɢ ᴛᴏ ᴀᴅᴅ ғᴇᴡ ᴍᴏʀᴇ ᴄᴏᴍᴍᴀɴᴅs ᴛᴏ ᴀᴅᴅ ᴍᴜᴄʜ ғᴜɴ !!\n\n$_> ʏᴏᴜ'ʟʟ ɢᴇᴛ ᴛᴏ sᴇᴇ ᴛʜɪs ᴜᴘᴅᴀᴛᴇ sᴏᴏɴ ! , ᴀᴘᴘʀᴏx = 𝟷𝟹ᴛʜ ᴊᴜɴᴇ 𝟸𝟶𝟸𝟷\n\n$_> ᴘᴇʀsᴏɴᴀʟ ᴀɴᴅ ᴜɴᴏғғɪᴄɪᴀʟ ᴘʀᴏᴊᴇᴄᴛ ʙʏ [ᴀʟᴘʜᴀ](t.me/NotReallyAlpha)\n\n$_> ɴᴏ ᴄᴏᴘʏʀɪɢʜᴛ ᴡɪʟʟ ʙᴇ ᴘʀᴇsᴇɴᴛ ! ᴄᴏᴢ ᴛʜɪs ɪs ɢᴏɪɴɢ ᴛᴏ ᴍᴀᴅᴇ ᴜɴᴅᴇʀ ᴘᴇʀsᴏɴᴀʟ ʀᴇᴘᴏsɪᴛᴏʀʏ ᴏғ ᴀʟᴘʜᴀ !\n\n$_> ɪғ ʏᴏᴜ ʜᴀᴠɪɴɢ ᴄᴏᴏʟ ᴛʜᴏᴜɢʜᴛs ᴀʙᴏᴜᴛ ᴛʜɪs : ғᴏʀᴡᴀʀᴅ ᴛʜᴏsᴇ ᴛᴏ [ʜɪᴍ](t.me/NotReallyAlpha) ! ©\n\n$_> ᴛʜᴀɴᴋ ʏᴏᴜ ғᴏʀ ᴠɪsɪᴛɪɴɢ ! ʜᴀᴠᴇ ᴀ ɢᴏᴏᴅ ᴅᴀʏ .
"""

    # credits
    CREDITS = """
** ᴄʀᴇᴅɪᴛs **
••> ᴀʟɢᴏʀɪᴛʜᴍ ғᴏʀ ʙᴇᴛᴛɪɴɢ - [ʜᴇxᴀ](t.me/Monocapped_Octahedron_xd)\n\n••> ɪɴ ʟᴀᴡ ʀᴇʟᴀᴛᴇᴅ ᴄᴏᴍᴍᴀɴᴅs - [sʜᴇʀʀʏ](t.me/Creamy_02)\n\n••> ᴏᴡɴᴇʀ - [ɴᴀʏᴀɴᴛᴀʀᴀ](t.me/NotReallyNeon)\n\n••> ᴄᴏᴅᴇ ʙʏ - [•](t.me/NotReallyAlpha)
"""

    #gender button
    gender_button = [
          [InlineKeyboardButton("✨ sᴛᴀʀᴛ ʙᴏᴛ 🕊", url="t.me/nothehe_bot")]
    ]

    #algo
    ALGO = """
** ᴀʟɢᴏʀɪᴛʜᴍ **
ɪғ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ʙᴇ ʀɪᴄʜ ɪɴ ʟɪғᴇ ɢᴀᴍᴇs\n\nʏᴏᴜ ɴᴇᴇᴅ :\n\n•••> ᴀᴛ ʟᴇᴀsᴛ 𝟸𝟶𝟶ᴋ ᴄᴏɪɴs ɪɴɪᴛɪᴀʟʟʏ ɪғ ʏᴏᴜ ᴅᴏɴ’ᴛ ʜᴀᴠᴇ ᴛʜᴇɴ ᴛᴀᴋᴇ ɪᴛ ғʀᴏᴍ [ʜᴇxᴀ](t.me/Monocapped_Octahedron_xd)\n\n•••> ʙᴜʏ ᴀ ᴛɪɢᴇʀ ᴘᴇᴛ ғʀᴏᴍ sʜᴏᴘ, ʙʏ ᴛʜɪs ʏᴏᴜʀ ᴄʜᴀɴᴄᴇ ᴏғ ᴡɪɴɴɪɴɢ ɪɴ ʙᴇᴛ ᴡɪʟʟ ɪɴᴄʀᴇᴀsᴇs\n\n• ᴀғᴛᴇʀ ᴛʜᴇsᴇ ᴛᴡᴏ sᴛᴇᴘs\n\n•••> ᴡɪᴛʜᴅʀᴀᴡ ᴀʟʟ ᴏғ ʏᴏᴜʀ ᴍᴏɴᴇʏ ғʀᴏᴍ ʙᴀɴᴋ\n\n•••> ᴇsᴛɪᴍᴀᴛᴇ ᴀɴᴅ ʀᴏᴜɴᴅ ᴏғғ ᴛʜᴇ 𝟷𝟶% ᴠᴀʟᴜᴇ ᴏғ ʏᴏᴜʀ ᴄᴏɪɴs ᴀɴᴅ ʙᴇᴛ ᴛʜᴇᴍ 𝟸𝟶ᴛɪᴍᴇs\n\n•••> ʀᴇᴘᴇᴀᴛ ᴛʜɪs ᴘʀᴏᴄᴇss ᴄᴏɴᴛɪɴᴜᴏᴜsʟʏ!\n\n•••> ᴀғᴛᴇʀ ᴇᴠᴇʀʏ 𝟸𝟶 ᴛɪᴍᴇs ʏᴏᴜ ʙᴇᴛ ʏᴏᴜ’ʟʟ ʙᴇ ɪɴ ᴘʀᴏғɪᴛ ᴛʜᴀɴ ʙᴇғᴏʀᴇ\n\n•••> sᴛɪʟʟ ʜᴀᴠɪɴɢ ᴅᴏᴜʙᴛ ? ⬇️
"""

    #hexa button 
    hexa_button = [
          [InlineKeyboardButton("✨Ask Hexa🤍", url="t.me/Monocapped_Octahedron_xd")]
    ]

    #gender
    GENDER = """
• ʜᴇʟʟᴏ ! {}, ғᴏʟʟᴏᴡ ᴛʜᴇ sᴛᴇᴘs ʙᴇʟᴏᴡ 👇\n\n• sᴛᴀʀᴛ ʙᴏᴛ ɪɴ ᴘᴍ •••> sᴇᴛᴛɪɴɢs •••> ɢᴇɴᴅᴇʀ .
"""
